[notebook](http://localhost:8888/notebooks/scripts/21.ipynb)

In [33]:
import pandas as pd
from IPython.display import display
pd.set_option('display.max_rows', 4)
pd.set_option('display.max_columns', 10)

In [34]:
ufo = pd.read_csv('../data/ufo.csv')

In [35]:
ufo.loc[0, :]

City                       Ithaca
Colors Reported               NaN
                        ...
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [36]:
ufo.loc[[0, 1, 2], :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [37]:
ufo.loc[0:2, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [38]:
ufo.loc[0:2]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [39]:
ufo.loc[0:2, 'City']

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [40]:
ufo.loc[0:2, ['City', 'State']]

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [41]:
ufo.loc[0:2, 'City':'State']

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [42]:
ufo.loc[ufo.City=='Oakland', 'State']

1694     CA
2144     CA
         ..
16803    MD
17322    CA
Name: State, dtype: object

In [43]:
# iloc: select [integer(list), integer(list)]
ufo.iloc[[0, 1], [0, 3]]

          City State
0       Ithaca    NY
1  Willingboro    NJ

In [44]:
ufo.iloc[0:2, 0:4]

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ

In [45]:
ufo.iloc[0:2, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [46]:
# ufo.iloc[ufo.City=='Oakland', 'State'] won't work

In [47]:
# index_col: set index when reading data
drinks = pd.read_csv('../data/drinks.csv', index_col='country')
drinks

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
...,...,...,...,...,...
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [48]:
# ix: select [indexInt(list), indexInt(list)]
ufo.ix[0:2, 0:2]

          City Colors Reported
0       Ithaca             NaN
1  Willingboro             NaN
2      Holyoke             NaN

In [49]:
# ix: select [indexName(or indexInt)/columnName]
drinks.ix['Albania', 0]

89

In [50]:
drinks.ix[1, 'beer_servings']

89

In [51]:
drinks.ix['Albania':'Andorra', 0:2]

         beer_servings  spirit_servings
country
Albania             89              132
Algeria             25                0
Andorra            245              138

In [52]:
# drinks.iloc['Albania':'Andorra', 0:2] won't work neight
# drinks.loc['Albania':'Andorra', 0:2] #won't work neight
# drinks['Albania':'Andorra', 0:2] won't work